anthropic.claude-code
dbaeumer.vscode-eslint
docker.docker
dracula-theme.theme-dracula
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
inferrinizzard.prettier-sql-vscode
mongodb.mongodb-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
mtxr.sqltools
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
naco-siren.gradle-language
pkief.material-icon-theme
redhat.java
redis.redis-for-vscode
richardwillis.vscode-gradle-extension-pack
ritwickdey.liveserver
spywhere.guides
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
